In [1]:
import pandas as pd #importing pandas *still remember how it felt the first time
import sqlite3      #This will import the tool that let us connect to the database
import m

In [2]:
conn =  sqlite3.connect('factbook.db') # This assign the connection instance to the value conn



tables = '''SELECT 
                * 
            FROM sqlite_master 
            WHERE type = "table";'''    #This is a SQL querry that is looking for all the collunms of the tables in the database





pd.read_sql_query(tables, conn) #this helps pandas to read data from the database via the connection established earlier.

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

In [3]:
query_facts = '''SELECT
                    *
                FROM facts
                LIMIT 5;
                '''                 #This SQL query should bring back all columns of the table facts






pd.read_sql_query(query_facts,conn) #Reading the rows from the table facts in the database

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

In [4]:
query_max_min_pop = '''
                    SELECT 
                        MIN(population),
                        MAX(population),
                        MIN(population_growth),
                        MAX(population_growth)
                    FROM facts                  
                    '''                        #this is an SQL querry that will retun four columns that have been delivered from the facts table



pd.read_sql_query(query_max_min_pop, conn)     #This is how pandas fetch data from the table inside the facts table in the database * LOL this stuff makes me feel like I am a pro

,MIN(population),MAX(population),MIN(population_growth),MAX(population_growth)
0,0,7256490011,0.0,4.02

In [5]:
query_pop_zero = '''
                    SELECT
                        name
                    FROM facts
                    WHERE population = 0;
                  '''                    #This SQL query returns only one column from the table facts with the condition population is zero


pd.read_sql_query(query_pop_zero, conn)   #here we are making pandas to read data from the facts table in the database using the conn instance

         name
0  Antarctica

In [6]:
query_pop_max = '''
                    SELECT
                        name
                    FROM facts
                    WHERE population =7256490011 ;
                  '''                    #This SQL query returns only one column from the table facts with the condition population is 7256490011


pd.read_sql_query(query_pop_max, conn)   #here we are making pandas to read data from the facts table in the database using the conn instance

    name
0  World

### OBSERVATIONS FROM THE MAX AND MIN POP VALUES FROM THE FACT TABLE IN THE DATABASE

 - The zero population is population of the Antarctica where population, a place where it is not habitable 
 - The worlds population is the maximum and it is not one country so it also makes sense.

In [23]:
query_visualization = '''
                     SELECT
                         name AS Country,
                         population,
                         population_growth,
                         birth_rate,
                         death_rate
                      FROM facts
                      WHERE population != (select max(population) from facts)
and population != (select min(population) from facts)
                      ;
                    '''                                                       #This querry will return to us four columns of facts while skipping the rows with zero and maximum population
fig = plt.figure(figsize=(10,10))
ax = fig.add_subplot(111)



pd.read_sql_query(query_visualization, conn).hist(ax=ax)       #this will help pandas get the data from the database using the query we wrote above and the connection instance.

NameError: name 'plt' is not defined